lkoudelka/STM32WBA-BLE-Privacy/Projects/NUCLEO-WBA55CG/Applications/BLE/BLE_Privacy_Server/STM32_WPAN/App/app_ble.c
      /* Update Advertising data */
      uint8_t *adv_data_p;
      uint8_t adv_data_len;

      adv_data_p = &a_AdvData[0];
      adv_data_len = sizeof(a_AdvData);
      /* USER CODE BEGIN ADV_DATA_UPDATE_1 */

      /* USER CODE END ADV_DATA_UPDATE_1 */
      status = aci_gap_update_adv_data(adv_data_len, adv_data_p);
      if (status != BLE_STATUS_SUCCESS)
      {
        LOG_INFO_APP("==>> Start Advertising Failed, result: 0x%02X\n", status);
      }
      else
      {
        LOG_INFO_APP("==>> Success: Start Advertising\n");
      }      
      break;
    }
    case PROC_GAP_PERIPH_ADVERTISE_STOP:
    {
      status = aci_gap_set_non_discoverable();
      if (status != BLE_STATUS_SUCCESS)
      {
        LOG_INFO_APP("aci_gap_set_non_discoverable - fail, result: 0x%02X\n",status);
      }
      else
      {
        bleAppContext.Device_Connection_Status = (APP_BLE_ConnStatus_t)paramC;
        LOG_INFO_APP("==>> aci_gap_set_non_discoverable - Success\n");
      }
      break;
    }/* PROC_GAP_PERIPH_ADVERTISE_STOP */
    case PROC_GAP_PERIPH_ADVERTISE_DATA_UPDATE:
    {
      uint8_t *adv_data_p;
      uint8_t adv_data_len;

      adv_data_p = &a_AdvData[0];
      adv_data_len = sizeof(a_AdvData);
      /* USER CODE BEGIN ADV_DATA_UPDATE_2 */

      /* USER CODE END ADV_DATA_UPDATE_2 */
      status = aci_gap_update_adv_data(adv_data_len, adv_data_p);
      if (status != BLE_STATUS_SUCCESS)
      {
        LOG_INFO_APP("aci_gap_update_adv_data - fail, result: 0x%02X\n",status);
      }
      else
      {
        LOG_INFO_APP("==>> aci_gap_update_adv_data - Success\n");
      }

      break;
    }/* PROC_GAP_PERIPH_ADVERTISE_DATA_UPDATE */
    case PROC_GAP_PERIPH_CONN_PARAM_UPDATE:
    {
       status = aci_l2cap_connection_parameter_update_req(
                                                       bleAppContext.BleApplicationContext_legacy.connectionHandle,
                                                       paramA,
                                                       paramB,
                                                       paramC,
                                                       paramD);
      if (status != BLE_STATUS_SUCCESS)
      {
        LOG_INFO_APP("aci_l2cap_connection_parameter_update_req - fail, result: 0x%02X\n",status);
      }
      else
      {
        LOG_INFO_APP("==>> aci_l2cap_connection_parameter_update_req - Success\n");
      }

      break;
    }/* PROC_GAP_PERIPH_CONN_PARAM_UPDATE */
    /* USER CODE BEGIN ACI_CALL */
    
    case PROC_GAP_PERIPH_PRINT_BD_ADDR:
    {
      uint8_t Num_of_Addresses;
      Bonded_Device_Entry_t Bonded_Device_Entry[10];
      uint8_t Local_Resolvable_Addres[6];
      tBleStatus ret = aci_gap_get_bonded_devices( &Num_of_Addresses, Bonded_Device_Entry);
      if (ret != BLE_STATUS_SUCCESS)
      {
        LOG_INFO_APP("==>> aci_gap_get_bonded_devices : fail : 0x%x\n\r", ret);
      }
      else
      {
        for (uint8_t index = 0; index < Num_of_Addresses; index ++)
        {

          ret = hci_le_read_local_resolvable_address(Bonded_Device_Entry[index].Address_Type, Bonded_Device_Entry[index].Address, Local_Resolvable_Addres);
          if (ret != BLE_STATUS_SUCCESS)
          {
            LOG_INFO_APP("==>> hci_le_read_local_resolvable_address : fail : 0x%x\n\r", ret);
          }
          else
          {
            LOG_INFO_APP("==>> hci_le_read_local_resolvable_address : success\n");
            if (CFG_BD_ADDRESS_TYPE == GAP_STATIC_RANDOM_ADDR)
              LOG_INFO_APP("  -> Static Random address:");
            else
              LOG_INFO_APP("  -> Public bd address:");
            LOG_INFO_APP(" 0x%02X:%02X:%02X:%02X:%02X:%02X\n",
                                                                (uint8_t)(p_bd_addr[1] >> 8),
                                                                (uint8_t)(p_bd_addr[1]),
                                                                (uint8_t)(p_bd_addr[0] >> 24),
                                                                (uint8_t)(p_bd_addr[0] >> 16),
                                                                (uint8_t)(p_bd_addr[0] >> 8),
                                                                (uint8_t)(p_bd_addr[0]));
            LOG_INFO_APP("  -> Resolvable Private Address (RPA) : 0x%02X:%02X:%02X:%02X:%02X:%02X\n\r",
                                                                Local_Resolvable_Addres[5],
                                                                Local_Resolvable_Addres[4],
                                                                Local_Resolvable_Addres[3],
                                                                Local_Resolvable_Addres[2],
                                                                Local_Resolvable_Addres[1],
                                                                Local_Resolvable_Addres[0]);
          }
        }
      }
      break;
    }
    /* USER CODE END ACI_CALL */
    default:
      break;
  }

  /* USER CODE BEGIN Procedure_Gap_Peripheral_3 */

  /* USER CODE END Procedure_Gap_Peripheral_3 */
  return;
}

/* USER CODE BEGIN FD*/

/* USER CODE END FD*/

/*************************************************************
 *
 * LOCAL FUNCTIONS
 *
 *************************************************************/
static uint8_t HOST_BLE_Init(void)
{
  tBleStatus return_status;

  pInitParams.numAttrRecord           = CFG_BLE_NUM_GATT_ATTRIBUTES;
  pInitParams.numAttrServ             = CFG_BLE_NUM_GATT_SERVICES;
  pInitParams.attrValueArrSize        = CFG_BLE_ATT_VALUE_ARRAY_SIZE;
  pInitParams.prWriteListSize         = CFG_BLE_ATTR_PREPARE_WRITE_VALUE_SIZE;
  pInitParams.attMtu                  = CFG_BLE_ATT_MTU_MAX;
  pInitParams.max_coc_nbr             = CFG_BLE_COC_NBR_MAX;
  pInitParams.max_coc_mps             = CFG_BLE_COC_MPS_MAX;
  pInitParams.max_coc_initiator_nbr   = CFG_BLE_COC_INITIATOR_NBR_MAX;
  pInitParams.numOfLinks              = CFG_BLE_NUM_LINK;
  pInitParams.mblockCount             = CFG_BLE_MBLOCK_COUNT;
  pInitParams.bleStartRamAddress      = (uint8_t*)buffer;
  pInitParams.total_buffer_size       = BLE_DYN_ALLOC_SIZE;
  pInitParams.bleStartRamAddress_GATT = (uint8_t*)gatt_buffer;
  pInitParams.total_buffer_size_GATT  = BLE_GATT_BUF_SIZE;
  pInitParams.options                 = CFG_BLE_OPTIONS;
  pInitParams.debug                   = 0U;
/* USER CODE BEGIN HOST_BLE_Init_Params */

/* USER CODE END HOST_BLE_Init_Params */
  return_status = BleStack_Init(&pInitParams);
/* USER CODE BEGIN HOST_BLE_Init */

/* USER CODE END HOST_BLE_Init */
  return ((uint8_t)return_status);
}

static void Ble_Hci_Gap_Gatt_Init(void)
{
  uint8_t role;
  uint16_t gap_service_handle = 0U, gap_dev_name_char_handle = 0U, gap_appearance_char_handle = 0U;
  //uint32_t p_bd_addr[2];
  uint16_t a_appearance[1] = {CFG_GAP_APPEARANCE};
  tBleStatus ret;

  /* USER CODE BEGIN Ble_Hci_Gap_Gatt_Init*/

  /* USER CODE END Ble_Hci_Gap_Gatt_Init*/

  LOG_INFO_APP("==>> Start Ble_Hci_Gap_Gatt_Init function\n");

  /**
   * Static random Address
   * The two upper bits shall be set to 1
   * The lowest 32bits is read from the UDN to differentiate between devices
   * The RNG may be used to provide a random number on each power on
   */
#if defined(CFG_STATIC_RANDOM_ADDRESS)	
  uint32_t udn = LL_FLASH_GetUDN();

  if (udn != 0xFFFFFFFF)
  {
    uint32_t company_id = LL_FLASH_GetSTCompanyID();
    uint32_t device_id = LL_FLASH_GetDeviceID();

  /**
   * Public Address with the ST company ID
   * bit[47:24] : 24bits (OUI) equal to the company ID
   * bit[23:16] : Device ID.
   * bit[15:0] : The last 16bits from the UDN
   * Note: In order to use the Public Address in a final product, a dedicated
   * 24bits company ID (OUI) shall be bought.
   */
    p_bd_addr[0] = (uint32_t)((company_id & 0x000000FF) << 24) | (uint32_t)(device_id << 16) | (uint32_t)(udn & 0x0000FF00) | (uint32_t)(udn & 0x000000FF);
    p_bd_addr[1] = (uint32_t)((company_id & 0x00FF0000) >> 16) | (uint32_t)((company_id & 0x0000FF00) >> 8);
  }
	else
	{
    p_bd_addr[0] = CFG_STATIC_RANDOM_ADDRESS & 0xFFFFFFFF;
    p_bd_addr[1] = (uint32_t)((uint64_t)CFG_STATIC_RANDOM_ADDRESS >> 32);	
	}
		
