lkoudelka/STM32WBA-BLE-Privacy/Projects/NUCLEO-WBA55CG/Applications/BLE/BLE_Privacy_Server/STM32_WPAN/App/app_ble.c
  p_bd_addr[1] |= 0xC000; /* The two upper bits shall be set to 1 */
#else
  /* Random address generation */
  HW_RNG_Get(1, &p_bd_addr[1]);
  HW_RNG_Get(1, &p_bd_addr[0]);
#endif /* CFG_STATIC_RANDOM_ADDRESS */

  ret = aci_hal_write_config_data(CONFIG_DATA_RANDOM_ADDRESS_OFFSET, CONFIG_DATA_RANDOM_ADDRESS_LEN, (uint8_t*)p_bd_addr);
  if (ret != BLE_STATUS_SUCCESS)
  {
    LOG_INFO_APP("  Fail   : aci_hal_write_config_data command - CONFIG_DATA_RANDOM_ADDRESS_OFFSET, result: 0x%02X\n", ret);
  }
  else
  {
    LOG_INFO_APP("  Success: aci_hal_write_config_data command - CONFIG_DATA_RANDOM_ADDRESS_OFFSET\n");
    LOG_INFO_APP("  Random Bluetooth Address: %02X:%02X:%02X:%02X:%02X:%02X\n", (uint8_t)(p_bd_addr[1] >> 8),
                                                                               (uint8_t)(p_bd_addr[1]),
                                                                               (uint8_t)(p_bd_addr[0] >> 24),
                                                                               (uint8_t)(p_bd_addr[0] >> 16),
                                                                               (uint8_t)(p_bd_addr[0] >> 8),
                                                                               (uint8_t)(p_bd_addr[0]));
  }

  const uint8_t a_BLE_CfgIrValue[16] = {(uint8_t)(p_bd_addr[0]),(uint8_t)(p_bd_addr[0]),(uint8_t)(p_bd_addr[0]),(uint8_t)(p_bd_addr[0]),(uint8_t)(p_bd_addr[0]),(uint8_t)(p_bd_addr[0]),(uint8_t)(p_bd_addr[0]),(uint8_t)(p_bd_addr[0]),(uint8_t)(p_bd_addr[0]),(uint8_t)(p_bd_addr[0]),(uint8_t)(p_bd_addr[0]),(uint8_t)(p_bd_addr[0]),(uint8_t)(p_bd_addr[0]),(uint8_t)(p_bd_addr[0]),(uint8_t)(p_bd_addr[0]),(uint8_t)(p_bd_addr[0])};
  LOG_INFO_APP("  IRK = ");
  for (int8_t i = 15; i>= 0; i--)
  {
    LOG_INFO_APP("%02X:", a_BLE_CfgIrValue[i]);
  }
  LOG_INFO_APP("\n");  
  /* Write Identity root key used to derive IRK and DHK(Legacy) */
  ret = aci_hal_write_config_data(CONFIG_DATA_IR_OFFSET, CONFIG_DATA_IR_LEN, (uint8_t*)a_BLE_CfgIrValue);
  if (ret != BLE_STATUS_SUCCESS)
  {
    LOG_INFO_APP("  Fail   : aci_hal_write_config_data command - CONFIG_DATA_IR_OFFSET, result: 0x%02X\n", ret);
  }
  else
  {
    LOG_INFO_APP("  Success: aci_hal_write_config_data command - CONFIG_DATA_IR_OFFSET\n");
  }

  const uint8_t a_BLE_CfgErValue[16] = {(uint8_t)(p_bd_addr[0] >> 8),(uint8_t)(p_bd_addr[0] >> 8),(uint8_t)(p_bd_addr[0] >> 8),(uint8_t)(p_bd_addr[0] >> 8),(uint8_t)(p_bd_addr[0] >> 8),(uint8_t)(p_bd_addr[0] >> 8),(uint8_t)(p_bd_addr[0] >> 8),(uint8_t)(p_bd_addr[0] >> 8),(uint8_t)(p_bd_addr[0] >> 8),(uint8_t)(p_bd_addr[0] >> 8),(uint8_t)(p_bd_addr[0] >> 8),(uint8_t)(p_bd_addr[0] >> 8),(uint8_t)(p_bd_addr[0] >> 8),(uint8_t)(p_bd_addr[0] >> 8),(uint8_t)(p_bd_addr[0] >> 8),(uint8_t)(p_bd_addr[0] >> 8)};
  LOG_INFO_APP("  ERK = ");
  for (int8_t i = 15; i>= 0; i--)
  {
    LOG_INFO_APP("%02X:", a_BLE_CfgErValue[i]);
  }
  LOG_INFO_APP("\n");  
  /* Write Encryption root key used to derive LTK and CSRK */
  ret = aci_hal_write_config_data(CONFIG_DATA_ER_OFFSET, CONFIG_DATA_ER_LEN, (uint8_t*)a_BLE_CfgErValue);
  if (ret != BLE_STATUS_SUCCESS)
  {
    LOG_INFO_APP("  Fail   : aci_hal_write_config_data command - CONFIG_DATA_ER_OFFSET, result: 0x%02X\n", ret);
  }
  else
  {
    LOG_INFO_APP("  Success: aci_hal_write_config_data command - CONFIG_DATA_ER_OFFSET\n");
  }

  /* Set Transmission RF Power. */
  ret = aci_hal_set_tx_power_level(1, CFG_TX_POWER);
  if (ret != BLE_STATUS_SUCCESS)
  {
    LOG_INFO_APP("  Fail   : aci_hal_set_tx_power_level command, result: 0x%02X\n", ret);
  }
  else
  {
    LOG_INFO_APP("  Success: aci_hal_set_tx_power_level command\n");
  }

  /* Initialize GATT interface */
  ret = aci_gatt_init();
  if (ret != BLE_STATUS_SUCCESS)
  {
    LOG_INFO_APP("  Fail   : aci_gatt_init command, result: 0x%02X\n", ret);
  }
  else
  {
    LOG_INFO_APP("  Success: aci_gatt_init command\n");
  }

  /* Initialize GAP interface */
  role = 0U;
  role |= GAP_PERIPHERAL_ROLE;

  /* USER CODE BEGIN Role_Mngt*/

  /* USER CODE END Role_Mngt */

  if (role > 0)
  {
    ret = aci_gap_init(role,
                       CFG_PRIVACY,
                       sizeof(a_GapDeviceName),
                       &gap_service_handle,
                       &gap_dev_name_char_handle,
                       &gap_appearance_char_handle);

    if (ret != BLE_STATUS_SUCCESS)
    {
      LOG_INFO_APP("  Fail   : aci_gap_init command, result: 0x%02X\n", ret);
    }
    else
    {
      LOG_INFO_APP("  Success: aci_gap_init command\n");
    }

    ret = aci_gatt_update_char_value(gap_service_handle,
                                     gap_dev_name_char_handle,
                                     0,
                                     sizeof(a_GapDeviceName),
                                     (uint8_t *) a_GapDeviceName);
    if (ret != BLE_STATUS_SUCCESS)
    {
      LOG_INFO_APP("  Fail   : aci_gatt_update_char_value - Device Name, result: 0x%02X\n", ret);
    }
    else
    {
      LOG_INFO_APP("  Success: aci_gatt_update_char_value - Device Name\n");
    }

    ret = aci_gatt_update_char_value(gap_service_handle,
                                     gap_appearance_char_handle,
                                     0,
                                     sizeof(a_appearance),
                                     (uint8_t *)&a_appearance);
    if (ret != BLE_STATUS_SUCCESS)
    {
      LOG_INFO_APP("  Fail   : aci_gatt_update_char_value - Appearance, result: 0x%02X\n", ret);
    }
    else
    {
      LOG_INFO_APP("  Success: aci_gatt_update_char_value - Appearance\n");
    }
  }
  else
  {
    LOG_ERROR_APP("GAP role cannot be null\n");
  }

  /* Initialize Default PHY */
  ret = hci_le_set_default_phy(CFG_PHY_PREF, CFG_PHY_PREF_TX, CFG_PHY_PREF_RX);
  if (ret != BLE_STATUS_SUCCESS)
  {
    LOG_INFO_APP("  Fail   : hci_le_set_default_phy command, result: 0x%02X\n", ret);
  }
  else
  {
    LOG_INFO_APP("  Success: hci_le_set_default_phy command\n");
  }

  /* Initialize IO capability */
  bleAppContext.BleApplicationContext_legacy.bleSecurityParam.ioCapability = CFG_IO_CAPABILITY;
  ret = aci_gap_set_io_capability(bleAppContext.BleApplicationContext_legacy.bleSecurityParam.ioCapability);
  if (ret != BLE_STATUS_SUCCESS)
  {
    LOG_INFO_APP("  Fail   : aci_gap_set_io_capability command, result: 0x%02X\n", ret);
  }
  else
  {
    LOG_INFO_APP("  Success: aci_gap_set_io_capability command\n");
  }

