lkoudelka/STM32WBA-BLE-Privacy/Projects/NUCLEO-WBA55CG/Applications/BLE/BLE_Privacy_Server/STM32_WPAN/App/app_ble.c
  /* Initialize authentication */
  bleAppContext.BleApplicationContext_legacy.bleSecurityParam.mitm_mode             = CFG_MITM_PROTECTION;
  bleAppContext.BleApplicationContext_legacy.bleSecurityParam.encryptionKeySizeMin  = CFG_ENCRYPTION_KEY_SIZE_MIN;
  bleAppContext.BleApplicationContext_legacy.bleSecurityParam.encryptionKeySizeMax  = CFG_ENCRYPTION_KEY_SIZE_MAX;
  bleAppContext.BleApplicationContext_legacy.bleSecurityParam.Use_Fixed_Pin         = CFG_USED_FIXED_PIN;
  bleAppContext.BleApplicationContext_legacy.bleSecurityParam.Fixed_Pin             = CFG_FIXED_PIN;
  bleAppContext.BleApplicationContext_legacy.bleSecurityParam.bonding_mode          = CFG_BONDING_MODE;
  /* USER CODE BEGIN Ble_Hci_Gap_Gatt_Init_1*/
  fill_advData(&a_AdvData[0], sizeof(a_AdvData), (uint8_t*) p_bd_addr);
  /* USER CODE END Ble_Hci_Gap_Gatt_Init_1*/

  ret = aci_gap_set_authentication_requirement(bleAppContext.BleApplicationContext_legacy.bleSecurityParam.bonding_mode,
                                               bleAppContext.BleApplicationContext_legacy.bleSecurityParam.mitm_mode,
                                               CFG_SC_SUPPORT,
                                               CFG_KEYPRESS_NOTIFICATION_SUPPORT,
                                               bleAppContext.BleApplicationContext_legacy.bleSecurityParam.encryptionKeySizeMin,
                                               bleAppContext.BleApplicationContext_legacy.bleSecurityParam.encryptionKeySizeMax,
                                               bleAppContext.BleApplicationContext_legacy.bleSecurityParam.Use_Fixed_Pin,
                                               bleAppContext.BleApplicationContext_legacy.bleSecurityParam.Fixed_Pin,
                                               CFG_BD_ADDRESS_TYPE);
  if (ret != BLE_STATUS_SUCCESS)
  {
    LOG_INFO_APP("  Fail   : aci_gap_set_authentication_requirement command, result: 0x%02X\n", ret);
  }
  else
  {
    LOG_INFO_APP("  Success: aci_gap_set_authentication_requirement command\n");
  }

  /* Initialize whitelist */
  if (bleAppContext.BleApplicationContext_legacy.bleSecurityParam.bonding_mode)
  {
    ret = aci_gap_configure_whitelist();
    if (ret != BLE_STATUS_SUCCESS)
    {
      LOG_INFO_APP("  Fail   : aci_gap_configure_whitelist command, result: 0x%02X\n", ret);
    }
    else
    {
      LOG_INFO_APP("  Success: aci_gap_configure_whitelist command\n");
    }
  }
  
  ret = hci_le_set_resolvable_private_address_timeout(0x000A);
  if (ret != BLE_STATUS_SUCCESS)
  {
    LOG_INFO_APP("  Fail   : hci_le_set_resolvable_private_address_timeout command, result: 0x%02X\n", ret);
  }
  else
  {
    LOG_INFO_APP("  Success: hci_le_set_resolvable_private_address_timeout command | Set to 10 sec\n");
  }
  
  uint8_t Num_of_Addresses;
  Bonded_Device_Entry_t Bonded_Device_Entry[10];
  List_Entry_t List_Entry[10];
  aci_gap_get_bonded_devices( &Num_of_Addresses, Bonded_Device_Entry);
  LOG_INFO_APP("==>> aci_gap_get_bonded_devices : success\n\r");
  LOG_INFO_APP("     - Num of addresses:   0x%x\n", Num_of_Addresses);
  for (uint8_t index = 0; index < Num_of_Addresses; index ++)
  {
    LOG_INFO_APP("     - addresse %d type:    0x%x\n     - addresse %d val:    0x%02X:%02X:%02X:%02X:%02X:%02X\n\r", index, Bonded_Device_Entry[index].Address_Type, index, 
                                                                                      Bonded_Device_Entry[index].Address[5],
                                                                                      Bonded_Device_Entry[index].Address[4],
                                                                                      Bonded_Device_Entry[index].Address[3],
                                                                                      Bonded_Device_Entry[index].Address[2],
                                                                                      Bonded_Device_Entry[index].Address[1],
                                                                                      Bonded_Device_Entry[index].Address[0]);
  
    List_Entry[index].Address_Type = Bonded_Device_Entry[index].Address_Type; 
    List_Entry[index].Address[5] = Bonded_Device_Entry[index].Address[5];
    List_Entry[index].Address[4] = Bonded_Device_Entry[index].Address[4];
    List_Entry[index].Address[3] = Bonded_Device_Entry[index].Address[3];
    List_Entry[index].Address[2] = Bonded_Device_Entry[index].Address[2];
    List_Entry[index].Address[1] = Bonded_Device_Entry[index].Address[1];
    List_Entry[index].Address[0] = Bonded_Device_Entry[index].Address[0];
        
  }
  if (Num_of_Addresses > 0)
  {
    ret = aci_gap_add_devices_to_list( Num_of_Addresses, &List_Entry[0], 0x1);
    if (ret != BLE_STATUS_SUCCESS)
    {
      LOG_INFO_APP("==>> aci_gap_add_devices_to_list : fail : 0x%x\n\r", ret);
    }
    else
    {
      LOG_INFO_APP("==>> aci_gap_add_devices_to_list : success\n\r");
    }
  } 
  
  APP_BLE_Procedure_Gap_Peripheral(PROC_GAP_PERIPH_ADVERTISE_DATA_UPDATE);
  LOG_INFO_APP("==>> End Ble_Hci_Gap_Gatt_Init function\n");

  return;
}

static void Ble_UserEvtRx( void)
{
  SVCCTL_UserEvtFlowStatus_t svctl_return_status;
  BleEvtPacket_t *phcievt = NULL;

  LST_remove_head ( &BleAsynchEventQueue, (tListNode **)&phcievt );

  svctl_return_status = SVCCTL_UserEvtRx((void *)&(phcievt->evtserial));

  if (svctl_return_status != SVCCTL_UserEvtFlowDisable)
  {
    AMM_Free((uint32_t *)phcievt);
  }
  else
  {
    LST_insert_head ( &BleAsynchEventQueue, (tListNode *)phcievt );
  }

  if ((LST_is_empty(&BleAsynchEventQueue) == FALSE) && (svctl_return_status != SVCCTL_UserEvtFlowDisable) )
  {
    UTIL_SEQ_SetTask(1U << CFG_TASK_HCI_ASYNCH_EVT_ID, CFG_SEQ_PRIO_0);
  }

  /* set the BG_BleStack_Process task for scheduling */
  UTIL_SEQ_SetTask(1U << CFG_TASK_BLE_HOST, CFG_SEQ_PRIO_0);

}

static void BleStack_Process_BG(void)
{
  if (BleStack_Process( ) == 0x0)
  {
    BleStackCB_Process( );
  }
}

static void gap_cmd_resp_release(void)
{
  UTIL_SEQ_SetEvt(1U << CFG_IDLEEVT_PROC_GAP_COMPLETE);
  return;
}

